# Lab Assignment No 2 - Louise Gordon

##### 200013271

##### https://github.com/louisegordon/PY4SA_Assignment.git

In [24]:
import pandas as py
import numpy as py

### Task 1

In [5]:
num=int(input("YOUR VALUE"))
if (num%3==0):
    print("Your value is divisble by three")
else:
    print("Your value is not divisble by three")

YOUR VALUE 5

Your value is not divisble by three

### Task 2

In [1]:
#If... else statement - fruits
lst = ['apple', 'orange', 'pear', 'kiwi', 'strawberry'] #creating list of fruits
i = "apple" #i as fruit input
if i in lst: #check if fruit is in list
    print((i), "is acceptable") #print if fruit is in list
else:
    print((i), "is not acceptable") #print if fruit is not in list

apple is acceptable

### Task 3

In [ ]:
#function to calculate distance between two coordinates using haversine formula

# Section 2 - Pandas and NumPy

In [5]:
import pandas as pd

trees_df = pd.read_csv("Assignment 2 Data/portland_park_trees.csv")
trees_df

,fid,OBJECTID,Inventory_,Species,DBH,Condition,TreeHeight,CrownWidth,CrownWid_1,CollectedB,...,Genus,Common_nam,Genus_spec,Functional,Size,Native,Edible,Nuisance,Origin,Species_fa
0,1,426,2017/05/09,PSME,37.4,Fair,105.0,44.0,57.0,staff,...,Pseudotsuga,Douglas-fir,Pseudotsuga menziesii,CE,L,Yes,NaN,NaN,North America - from British Columbia south to...,Bracts on cones look like a mouse's feet and t...
1,2,427,2017/05/09,PSME,32.5,Fair,94.0,49.0,45.0,staff,...,Pseudotsuga,Douglas-fir,Pseudotsuga menziesii,CE,L,Yes,NaN,NaN,North America - from British Columbia south to...,Bracts on cones look like a mouse's feet and t...
2,3,428,2017/05/09,CRLA,9.7,Fair,23.0,28.0,27.0,staff,...,Crataegus,Lavalle hawthorn,Crataegus x lavalleei,BD,S,No,NaN,NaN,North America - a hybrid between a Mexican and...,"Like most hawthorns, the tree has stout thorns..."
3,4,429,2017/05/09,QURU,10.3,Poor,28.0,38.0,31.0,staff,...,Quercus,northern red oak,Quercus rubra,BD,L,No,NaN,NaN,North America - eastern Canada and eastern USA...,Acorns take two years to mature and are an imp...
4,5,430,2017/05/09,PSME,33.2,Fair,102.0,43.0,44.0,staff,...,Pseudotsuga,Douglas-fir,Pseudotsuga menziesii,CE,L,Yes,NaN,NaN,North America - from British Columbia south to...,Bracts on cones look like a mouse's feet and t...
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25529,25530,726046,2018/08/16,QURU,31.6,Fair,74.0,50.0,46.0,volunteer,...,Quercus,northern red oak,Quercus rubra,BD,L,No,NaN,NaN,North America - eastern Canada and eastern USA...,Acorns take two years to mature and are an imp...
25530,25531,726443,2019/10/11,PSME,0.4,Good,8.0,6.0,6.0,staff,...,Pseudotsuga,Douglas-fir,Pseudotsuga menziesii,CE,L,Yes,NaN,NaN,North America - from British Columbia south to...,Bracts on cones look like a mouse's feet and t...
25531,25532,726444,2019/10/11,MEGL,26.3,Fair,79.0,30.0,40.0,staff,...,Metasequoia,dawn redwood,Metasequoia glyptostroboides,CD,L,No,NaN,NaN,Asia - central China,"A deciduous conifer, dawn redwood is Oregon's ..."
25532,25533,726445,2019/10/11,PCSI,8.8,Fair,43.0,20.0,20.0,staff,...,Picea,Sitka spruce,Picea sitchensis,CE,L,Yes,NaN,NaN,North America - Alaska south to British Columb...,"Green, 1"" long, typically flat needles are the..."
25533,25534,726446,2019/10/11,COKO,2.0,Good,18.0,13.0,13.0,staff,...,Cornus,kousa dogwood,Cornus kousa,BD,S,No,NaN,NaN,"Asia - Japan, Korea",A 20-30' tree with showy white flower bracts t...

### Q1

In [26]:
#total number of Quercus and Acer genus

Quercus_Acer=trees_df.loc[trees_df["Genus"].isin(["Quercus","Acer"])] #create dataframe of Quercus and Acer
print(len(Quercus_Acer)) #length of dataframe

5675

### Q2

In [27]:
#number of Quercus and Acer genus with a DBH of over 50inchs
DBH50 = Quercus_Acer.loc[Quercus_Acer["DBH"] > 50] #used Quercus_Acer df made previosuly and quired it to look at DBH over 50
print(len(DBH50)) #length of dataframe

124

### Q3

In [32]:
Quercusdf = trees_df.loc[trees_df["Genus"].isin(["Quercus"])]
Quercusdf["DBH"].mean()

23.56823839157492

In [37]:
QAFdf = trees_df.loc[trees_df["Genus"].isin(["Quercus", "Acer", "Fraxinus"])] #dataframe with the three genera 
QAFdf.groupby("Genus")["DBH"].mean().sort_values(ascending=False) # DBH of each gensus sorted in ascending value showing Quercus with highest mean

Genus
Quercus     23.568238
Acer        18.419085
Fraxinus    11.033610
Name: DBH, dtype: float64

### Q4

In [22]:
#number of different species of trees recorded in Acer genus
Acerdf = trees_df.loc[trees_df["Genus"].isin(["Acer"])] #create dataframe for Acer Genus
AcerSpecies = Acerdf["Species"].count() #count acer species
print(AcerSpecies)#print the number of species from

3586

### Q5

In [29]:
world_cities_df = pd.read_csv("Assignment 2 Data/world_cities.csv")
world_cities_df

                     city       country     pop    lat    lon  capital
0      'Abasan al-Jadidah     Palestine    5629  31.31  34.34        0
1      'Abasan al-Kabirah     Palestine   18999  31.32  34.35        0
2            'Abdul Hakim      Pakistan   47788  30.55  72.11        0
3      'Abdullah-as-Salam        Kuwait   21817  29.36  47.98        0
4                   'Abud     Palestine    2456  32.03  35.07        0
...                   ...           ...     ...    ...    ...      ...
43640           az-Zubayr          Iraq  124611  30.39  47.71        0
43641            az-Zulfi  Saudi Arabia   54070  26.30  44.80        0
43642       az-Zuwaytinah         Libya   21984  30.95  20.12        0
43643        s-Gravenhage   Netherlands  479525  52.07   4.30        0
43644     s-Hertogenbosch   Netherlands  135529  51.68   5.30        0

[43645 rows x 6 columns]

In [43]:
#creating Pop_M column 

world_cities_df['pop_M'] = world_cities_df.loc[:, 'pop'] #duplicate the pop column and change the name to Pop_M
print(world_cities_df)

                     city       country     pop    lat    lon  capital  \
0      'Abasan al-Jadidah     Palestine    5629  31.31  34.34        0
1      'Abasan al-Kabirah     Palestine   18999  31.32  34.35        0
2            'Abdul Hakim      Pakistan   47788  30.55  72.11        0
3      'Abdullah-as-Salam        Kuwait   21817  29.36  47.98        0
4                   'Abud     Palestine    2456  32.03  35.07        0
...                   ...           ...     ...    ...    ...      ...
43640           az-Zubayr          Iraq  124611  30.39  47.71        0
43641            az-Zulfi  Saudi Arabia   54070  26.30  44.80        0
43642       az-Zuwaytinah         Libya   21984  30.95  20.12        0
43643        s-Gravenhage   Netherlands  479525  52.07   4.30        0
43644     s-Hertogenbosch   Netherlands  135529  51.68   5.30        0

              Pop_M   pop_M
0      5.629000e-39    5629
1      1.899900e-38   18999
2      4.778800e-38   47788
3      2.181700e-38   21817
4      2.456000e-39    2456
...             ...     ...
43640  1.246110e-37  124611
43641  5.407000e-38   54070
43642  2.198400e-38   21984
43643  4.795250e-37  479525
43644  1.355290e-37  135529

[43645 rows x 8 columns]

In [42]:
#creating Pop_M column 

def to_million(x):
    return x/1000000
world_cities_df.Pop_M = world_cities_df.Pop_M.apply(to_million)
world_cities_df

,city,country,pop,lat,lon,capital,Pop_M
0,'Abasan al-Jadidah,Palestine,5629,31.31,34.34,0,5.629000e-39
1,'Abasan al-Kabirah,Palestine,18999,31.32,34.35,0,1.899900e-38
2,'Abdul Hakim,Pakistan,47788,30.55,72.11,0,4.778800e-38
3,'Abdullah-as-Salam,Kuwait,21817,29.36,47.98,0,2.181700e-38
4,'Abud,Palestine,2456,32.03,35.07,0,2.456000e-39
...,...,...,...,...,...,...,...
43640,az-Zubayr,Iraq,124611,30.39,47.71,0,1.246110e-37
43641,az-Zulfi,Saudi Arabia,54070,26.30,44.80,0,5.407000e-38
43642,az-Zuwaytinah,Libya,21984,30.95,20.12,0,2.198400e-38
43643,s-Gravenhage,Netherlands,479525,52.07,4.30,0,4.795250e-37
43644,s-Hertogenbosch,Netherlands,135529,51.68,5.30,0,1.355290e-37

In [62]:
#Remove the orginal pop column 
world_cities_popM_df = world_cities_df.drop('pop', axis=1)
world_cities_sorted_df = world_cities_popM_df.drop('pop_M', axis=1) #accidently duplicated pop so had 2x Pop_M so dropped one 
world_cities_sorted_df #Pop_M is the new pop column in millions

                     city       country    lat    lon  capital         Pop_M
0      'Abasan al-Jadidah     Palestine  31.31  34.34        0  5.629000e-39
1      'Abasan al-Kabirah     Palestine  31.32  34.35        0  1.899900e-38
2            'Abdul Hakim      Pakistan  30.55  72.11        0  4.778800e-38
3      'Abdullah-as-Salam        Kuwait  29.36  47.98        0  2.181700e-38
4                   'Abud     Palestine  32.03  35.07        0  2.456000e-39
...                   ...           ...    ...    ...      ...           ...
43640           az-Zubayr          Iraq  30.39  47.71        0  1.246110e-37
43641            az-Zulfi  Saudi Arabia  26.30  44.80        0  5.407000e-38
43642       az-Zuwaytinah         Libya  30.95  20.12        0  2.198400e-38
43643        s-Gravenhage   Netherlands  52.07   4.30        0  4.795250e-37
43644     s-Hertogenbosch   Netherlands  51.68   5.30        0  1.355290e-37

[43645 rows x 6 columns]

In [63]:
#subsetting city with same letter as my name, city=Los Angeles
just_LA = world_cities_sorted_df[world_cities_popM_df["city"]=="Long Beach"]
print(just_LA)

             city country    lat     lon  capital         Pop_M
21348  Long Beach     USA  33.79 -118.16        0  4.865710e-37

In [64]:
#subsetting 5 biggest cities from Long Beach 
#first find top 5 cities with highest population in USA
cities_USA = world_cities_sorted_df[world_cities_popM_df["country"]=="USA"] #create subset of USA countries
print(cities_USA)

              city country    lat     lon  capital         Pop_M
221        Abilene     USA  32.45  -99.74        0  1.138880e-37
746          Akron     USA  41.08  -81.52        0  2.066340e-37
810        Alameda     USA  37.77 -122.26        0  7.006900e-38
856         Albany     USA  44.62 -123.09        0  4.553500e-38
857         Albany     USA  31.58  -84.18        0  7.551000e-38
...            ...     ...    ...     ...      ...           ...
42445  Yorba Linda     USA  33.89 -117.77        0  6.593200e-38
42467   Youngstown     USA  41.10  -80.65        0  7.659000e-38
42485    Yuba City     USA  39.14 -121.62        0  5.408600e-38
42486      Yucaipa     USA  34.03 -117.04        0  5.233300e-38
42502         Yuma     USA  32.68 -114.62        0  8.572000e-38

[997 rows x 6 columns]

In [73]:
#find the top 5 USA cities with largest population
cities_USA.nlargest(5, ['Pop_M'])

              city country    lat     lon  capital         Pop_M
25877     New York     USA  40.67  -73.94        0  8.124427e-36
21435  Los Angeles     USA  34.11 -118.41        0  3.911500e-36
7366       Chicago     USA  41.84  -87.68        0  2.830144e-36
14769      Houston     USA  29.77  -95.39        0  2.043005e-36
28856      Phoenix     USA  33.54 -112.07        0  1.450884e-36

In [74]:
#subset 5 largest cities
top5_cities = cities_USA.nlargest(5, ['Pop_M'])
print(top5_cities)

              city country    lat     lon  capital         Pop_M
25877     New York     USA  40.67  -73.94        0  8.124427e-36
21435  Los Angeles     USA  34.11 -118.41        0  3.911500e-36
7366       Chicago     USA  41.84  -87.68        0  2.830144e-36
14769      Houston     USA  29.77  -95.39        0  2.043005e-36
28856      Phoenix     USA  33.54 -112.07        0  1.450884e-36

## Section 3 - Python Data Visualization

### Graph 1